[{"description": "A quick guide to start using pnbp", "post": "0", "title": "Getting Started", "content": "\n### Welcome!\n\nTo get started using pnbp, you need to configure your first site.\n\nWith pnbp, there's a specific directory structure that is at the base of every\nsite.\n\nIt looks something like this:\n\n    |- pages.yml\n    |\n    |-- data\n       \\ - static\n\n#### `pages.yml`\n\nThis file specifies every page that's created, along with what template\ndirectories/files are going to be used. If no templates are specified,\n`templates/` is assumed as the default template directory.\n\n#### `data`\n\nThis is where all the information regarding any module will be kept.\n\n#### `data/static`\n\nThe static directory is what will be added into the root directory of the site\nwhen built. This is used for things such as cat pictures, cgi scripts and styles\nfor the site.\n\nSo far, this site wouldn't generate anything.\n\nTo get a working site, we need [configure one](/docs/post/site_configuration)\n"}, {"description": "Specifications on the Site config file", "post": "1", "title": "Site configuration", "content": "\nFor every page, there's an entry in the pages.yml file specifying the template,\nmodule and page-variables/includes.\n\nA basic pages.yml:\n\n    (pagename):\n      template: \"templates/standard.html\"\n      pagevar:\n        $include: \"includes/include.html\"\n        var: \"Variable\"\n      pagemod:\n        (modid):\n          mod: \"page\"\n    (pagename):\n      template: \"templates/other.html\"\n      pagevar:\n        title: \"pnbp\"\n      pagemod:\n        (modid):\n          mod: \"page\"\n          settings:\n            location: \"space\"\n\n### `(pagename)`\n\nThis specifies the name and location of the page.\n\n\"index\" is a special term used to define the home page of the website, thus\ncreating this page in the root of the website.\n\n### [`template`](/docs/post/templates_and_includes/)\n\nThis specifies the location of the template that is going to be used in this\npage.\n\n### `pagevar`\n\nThese are the variables that are specified in the templates to be replaced with\nthe values specified.\n\nIncludes are specified with a `$` character at the beginning of the name of the\nvariable, followed by the the value being the location of the file to include.\n\n### `pagemod`\n\nThis is a specialized set of variables, pointing to a module that can create\nsubpages.\n\n`(modid)` is used for the id of the module that is being used. This may be used\nin different ways for different modules.\n\nFor information on the use of `(modid)`, refer to the module being used.\n"}, {"description": "How do template?", "post": "2", "title": "Templates and Includes", "content": "\nTemplates are the base of most websites. You have the fancy logo, navigation,\nand footers looking generally the same for every webpage, and the body of the\nwebpage is where the mutable and dynamic content resides. This doesn't mean you\nmust follow this paradigm, but it is helpful to be able to re-create this in \nyour website if you want to take advantage of what website generators are \ndesigned for.\n"}]